zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW47B42ZB7/KW47B42ZB7_cm33_core1_COMMON.h
/*
** ###################################################################
**     Processor:           KW47B42ZB7AFTA_cm33_core1
**     Compilers:           GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    Rev. 5, 2026-03-24
**     Version:             rev. 3.0, 2026-02-11
**     Build:               b260518
**
**     Abstract:
**         CMSIS Peripheral Access Layer for KW47B42ZB7_cm33_core1
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-10-13)
**         Rev. 1, 2024-10-13
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 3.0 (2026-02-11)
**         Based on CRR Rev 1.58.
**         Removed TSTMR.
**         Removed SIRC from SCG.
**         Removed EZH_BLCIN_3_0 and EZH_BLCIN_7_4 registers from TRGMUX.
**
** ###################################################################
*/

/*!
 * @file KW47B42ZB7_cm33_core1_COMMON.h
 * @version 3.0
 * @date 2026-02-11
 * @brief CMSIS Peripheral Access Layer for KW47B42ZB7_cm33_core1
 *
 * CMSIS Peripheral Access Layer for KW47B42ZB7_cm33_core1
 */

#if !defined(KW47B42ZB7_CM33_CORE1_COMMON_H_)
#define KW47B42ZB7_CM33_CORE1_COMMON_H_          /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0300U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 49                 /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M33 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M33 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M33 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M33 Usage Fault Interrupt */
  SecureFault_IRQn             = -9,               /**< Cortex-M33 Secure Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M33 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M33 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M33 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M33 System Tick Interrupt */

  /* Device specific interrupts */
  BLE_INT0_IRQn                = 0,
  BLE_INT1_IRQn                = 1,
  BLE_INT2_IRQn                = 2,
  BTU_FIQ_IRQn                 = 3,
  BTU_INT_IRQn                 = 4,
  BRF_INT_IRQn                 = 5,
  CTI_IRQ0_IRQn                = 6,
  T1_INT_IRQn                  = 7,
  T2_INT_IRQn                  = 8,
  T3_INT_IRQn                  = 9,
  T4_INT_IRQn                  = 10,
  WDG2_INT_IRQn                = 11,
  SI_INT_IRQn                  = 12,
  CTI_IRQ1_IRQn                = 13,
  CPU2_MSG_RDY_INT_IRQn        = 14,
  CPU2_MSG_SPC_AVAIL_INT_IRQn  = 15,
  ZIGBEE_INT_IRQn              = 16,
  CIU2_INT_IRQn                = 17,
  CPU2_ERR_INT_IRQn            = 18,
  GENLL_INT_IRQn               = 19,
  BRIC_INT_IRQn                = 20,
  RF_SFA_IRQn                  = 21,
  RBME_INT_IRQn                = 22,
  LCL_INT_IRQn                 = 23,
  RSM_INT_IRQn                 = 24,
  XO_RDY_INT_IRQn              = 25,
  PLL_ABORT_INT_IRQn           = 26,
  FMU_INT_IRQn                 = 27,
  WOR_INT_IRQn                 = 28,
  TPM2_INT_IRQn                = 29,               /**< Timer / PWM Module2 interrupt */
  DSB_IRQn                     = 30,
  SECSUBSYS_IRQn               = 31,
  LPTMR2_IRQn                  = 32                /**< Low-Power Timer2 interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M33 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M33 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               3         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  0         /**< Defines if an FPU is present or not */
#define __DSP_PRESENT                  0         /**< Defines if Armv8-M Mainline core supports DSP instructions */
#define __SAUREGION_PRESENT            0         /**< Defines if an SAU is present or not */

#include "core_cm33.h"                 /* Core Peripheral Access Layer */
#include "system_KW47B42ZB7_cm33_core1.h" /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


#ifndef KW47B42ZB7_cm33_core1_SERIES
#define KW47B42ZB7_cm33_core1_SERIES
#endif
/* CPU specific feature definitions */
#include "KW47B42ZB7_cm33_core1_features.h"

/* ADC - Peripheral instance base addresses */
/** Peripheral ADC0 base address */
#define ADC0_BASE                                (0xA91C7000u)
/** Peripheral ADC0 base pointer */
#define ADC0                                     ((ADC_Type *)ADC0_BASE)
/** Array initializer of ADC peripheral base addresses */
#define ADC_BASE_ADDRS                           { ADC0_BASE }
/** Array initializer of ADC peripheral base pointers */
#define ADC_BASE_PTRS                            { ADC0 }

/* ATX - Peripheral instance base addresses */
/** Peripheral ATX0 base address */
#define ATX0_BASE                                (0xA91CB000u)
/** Peripheral ATX0 base pointer */
#define ATX0                                     ((ATX_Type *)ATX0_BASE)
/** Array initializer of ATX peripheral base addresses */
#define ATX_BASE_ADDRS                           { ATX0_BASE }
/** Array initializer of ATX peripheral base pointers */
#define ATX_BASE_PTRS                            { ATX0 }

/* AXBS - Peripheral instance base addresses */
/** Peripheral AXBS0 base address */
#define AXBS0_BASE                               (0xA9180000u)
/** Peripheral AXBS0 base pointer */
#define AXBS0                                    ((AXBS_Type *)AXBS0_BASE)
/** Array initializer of AXBS peripheral base addresses */
#define AXBS_BASE_ADDRS                          { AXBS0_BASE }
/** Array initializer of AXBS peripheral base pointers */
#define AXBS_BASE_PTRS                           { AXBS0 }

/* BLE2_REG - Peripheral instance base addresses */
/** Peripheral BLE2_REG base address */
#define BLE2_REG_BASE                            (0xA9020000u)
/** Peripheral BLE2_REG base pointer */
#define BLE2_REG                                 ((BLE2_REG_Type *)BLE2_REG_BASE)
/** Array initializer of BLE2_REG peripheral base addresses */
#define BLE2_REG_BASE_ADDRS                      { BLE2_REG_BASE }
/** Array initializer of BLE2_REG peripheral base pointers */
#define BLE2_REG_BASE_PTRS                       { BLE2_REG }

/* BRIC - Peripheral instance base addresses */
/** Peripheral BRIC base address */
#define BRIC_BASE                                (0xA9106700u)
/** Peripheral BRIC base pointer */
#define BRIC                                     ((BRIC_Type *)BRIC_BASE)
/** Array initializer of BRIC peripheral base addresses */
#define BRIC_BASE_ADDRS                          { BRIC_BASE }
/** Array initializer of BRIC peripheral base pointers */
#define BRIC_BASE_PTRS                           { BRIC }

