zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW47B42ZB7/KW47B42ZB7_cm33_core1_COMMON.h
/* PORT - Peripheral instance base addresses */
/** Peripheral PORTA base address */
#define PORTA_BASE                               (0xA91C2000u)
/** Peripheral PORTA base pointer */
#define PORTA                                    ((PORT_Type *)PORTA_BASE)
/** Peripheral PORTB base address */
#define PORTB_BASE                               (0xA91C3000u)
/** Peripheral PORTB base pointer */
#define PORTB                                    ((PORT_Type *)PORTB_BASE)
/** Peripheral PORTC base address */
#define PORTC_BASE                               (0xA91C4000u)
/** Peripheral PORTC base pointer */
#define PORTC                                    ((PORT_Type *)PORTC_BASE)
/** Peripheral PORTD base address */
#define PORTD_BASE                               (0xA91C5000u)
/** Peripheral PORTD base pointer */
#define PORTD                                    ((PORT_Type *)PORTD_BASE)
/** Array initializer of PORT peripheral base addresses */
#define PORT_BASE_ADDRS                          { PORTA_BASE, PORTB_BASE, PORTC_BASE, PORTD_BASE }
/** Array initializer of PORT peripheral base pointers */
#define PORT_BASE_PTRS                           { PORTA, PORTB, PORTC, PORTD }

/* RADIO_CTRL - Peripheral instance base addresses */
/** Peripheral RADIO_CTRL base address */
#define RADIO_CTRL_BASE                          (0xA9106000u)
/** Peripheral RADIO_CTRL base pointer */
#define RADIO_CTRL                               ((RADIO_CTRL_Type *)RADIO_CTRL_BASE)
/** Array initializer of RADIO_CTRL peripheral base addresses */
#define RADIO_CTRL_BASE_ADDRS                    { RADIO_CTRL_BASE }
/** Array initializer of RADIO_CTRL peripheral base pointers */
#define RADIO_CTRL_BASE_PTRS                     { RADIO_CTRL }

/* RBME - Peripheral instance base addresses */
/** Peripheral RBME base address */
#define RBME_BASE                                (0xA9106200u)
/** Peripheral RBME base pointer */
#define RBME                                     ((RBME_Type *)RBME_BASE)
/** Array initializer of RBME peripheral base addresses */
#define RBME_BASE_ADDRS                          { RBME_BASE }
/** Array initializer of RBME peripheral base pointers */
#define RBME_BASE_PTRS                           { RBME }

/* REGFILE - Peripheral instance base addresses */
/** Peripheral REGFILE0 base address */
#define REGFILE0_BASE                            (0xA91A1000u)
/** Peripheral REGFILE0 base pointer */
#define REGFILE0                                 ((REGFILE_Type *)REGFILE0_BASE)
/** Peripheral REGFILE1 base address */
#define REGFILE1_BASE                            (0xA91A2000u)
/** Peripheral REGFILE1 base pointer */
#define REGFILE1                                 ((REGFILE_Type *)REGFILE1_BASE)
/** Array initializer of REGFILE peripheral base addresses */
#define REGFILE_BASE_ADDRS                       { REGFILE0_BASE, REGFILE1_BASE }
/** Array initializer of REGFILE peripheral base pointers */
#define REGFILE_BASE_PTRS                        { REGFILE0, REGFILE1 }

/* RFMC - Peripheral instance base addresses */
/** Peripheral RFMC base address */
#define RFMC_BASE                                (0xA91C0000u)
/** Peripheral RFMC base pointer */
#define RFMC                                     ((RFMC_Type *)RFMC_BASE)
/** Array initializer of RFMC peripheral base addresses */
#define RFMC_BASE_ADDRS                          { RFMC_BASE }
/** Array initializer of RFMC peripheral base pointers */
#define RFMC_BASE_PTRS                           { RFMC }

/* RF_CMC1 - Peripheral instance base addresses */
/** Peripheral RF_CMC1 base address */
#define RF_CMC1_BASE                             (0xA9143000u)
/** Peripheral RF_CMC1 base pointer */
#define RF_CMC1                                  ((RF_CMC1_Type *)RF_CMC1_BASE)
/** Array initializer of RF_CMC1 peripheral base addresses */
#define RF_CMC1_BASE_ADDRS                       { RF_CMC1_BASE }
/** Array initializer of RF_CMC1 peripheral base pointers */
#define RF_CMC1_BASE_PTRS                        { RF_CMC1 }

/* RF_FMCCFG - Peripheral instance base addresses */
/** Peripheral RF_FMCCFG base address */
#define RF_FMCCFG_BASE                           (0xA9142000u)
/** Peripheral RF_FMCCFG base pointer */
#define RF_FMCCFG                                ((RF_FMCCFG_Type *)RF_FMCCFG_BASE)
/** Array initializer of RF_FMCCFG peripheral base addresses */
#define RF_FMCCFG_BASE_ADDRS                     { RF_FMCCFG_BASE }
/** Array initializer of RF_FMCCFG peripheral base pointers */
#define RF_FMCCFG_BASE_PTRS                      { RF_FMCCFG }

/* RTC - Peripheral instance base addresses */
/** Peripheral RTC base address */
#define RTC_BASE                                 (0xA91AC000u)
/** Peripheral RTC base pointer */
#define RTC                                      ((RTC_Type *)RTC_BASE)
/** Array initializer of RTC peripheral base addresses */
#define RTC_BASE_ADDRS                           { RTC_BASE }
/** Array initializer of RTC peripheral base pointers */
#define RTC_BASE_PTRS                            { RTC }

/* RX_PACKET_RAM - Peripheral instance base addresses */
/** Peripheral RX_PACKET_RAM base address */
#define RX_PACKET_RAM_BASE                       (0xA9109000u)
/** Peripheral RX_PACKET_RAM base pointer */
#define RX_PACKET_RAM                            ((RX_PACKET_RAM_Type *)RX_PACKET_RAM_BASE)
/** Array initializer of RX_PACKET_RAM peripheral base addresses */
#define RX_PACKET_RAM_BASE_ADDRS                 { RX_PACKET_RAM_BASE }
/** Array initializer of RX_PACKET_RAM peripheral base pointers */
#define RX_PACKET_RAM_BASE_PTRS                  { RX_PACKET_RAM }

/* SCG - Peripheral instance base addresses */
/** Peripheral SCG0 base address */
#define SCG0_BASE                                (0xA919E000u)
/** Peripheral SCG0 base pointer */
#define SCG0                                     ((SCG_Type *)SCG0_BASE)
/** Array initializer of SCG peripheral base addresses */
#define SCG_BASE_ADDRS                           { SCG0_BASE }
/** Array initializer of SCG peripheral base pointers */
#define SCG_BASE_PTRS                            { SCG0 }

/* SEMA42 - Peripheral instance base addresses */
/** Peripheral SEMA42 base address */
#define SEMA42_BASE                              (0xA91BF000u)
/** Peripheral SEMA42 base pointer */
#define SEMA42                                   ((SEMA42_Type *)SEMA42_BASE)
/** Array initializer of SEMA42 peripheral base addresses */
#define SEMA42_BASE_ADDRS                        { SEMA42_BASE }
/** Array initializer of SEMA42 peripheral base pointers */
#define SEMA42_BASE_PTRS                         { SEMA42 }

